<a href="https://colab.research.google.com/github/KomalMano/Story/blob/master/Untitled9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
from google.colab import files
import io

In [2]:
uploaded = files.upload()

Saving stock_data.csv to stock_data.csv

In [3]:
for fn in uploaded.keys():
  print('User uploaded file "{name}" with length {length} bytes'.format(
      name=fn, length=len(uploaded[fn])))

User uploaded file "stock_data.csv" with length 199 bytes

In [4]:
uploaded

{'stock_data.csv': b'stock data,,,,\r\ntickers,eps,revenue,price,people\r\nGOOGLE,27.82,87,845,larry page\r\nWMT,4.61,484,65,n.a.\r\nMSFT,-1,85,64,bill gates\r\nRIL,not avaiable,50,1023,mukesh ambani\r\nTATA,5.6,-1,n.a.,ratan tata\r\n'}

In [5]:
df = pd.read_csv(io.StringIO(uploaded['stock_data.csv'].decode('utf-8')))
df

  stock data    Unnamed: 1 Unnamed: 2 Unnamed: 3     Unnamed: 4
0    tickers           eps    revenue      price         people
1     GOOGLE         27.82         87        845     larry page
2        WMT          4.61        484         65           n.a.
3       MSFT            -1         85         64     bill gates
4        RIL  not avaiable         50       1023  mukesh ambani
5       TATA           5.6         -1       n.a.     ratan tata

In [6]:
#we want to skip 1st row
df = pd.read_csv(io.StringIO(uploaded['stock_data.csv'].decode('utf-8')),skiprows=1)
df

  tickers           eps  revenue price         people
0  GOOGLE         27.82       87   845     larry page
1     WMT          4.61      484    65           n.a.
2    MSFT            -1       85    64     bill gates
3     RIL  not avaiable       50  1023  mukesh ambani
4    TATA           5.6       -1  n.a.     ratan tata

In [7]:
#same thing occur using header 
df = pd.read_csv(io.StringIO(uploaded['stock_data.csv'].decode('utf-8')),header=1)
df

  tickers           eps  revenue price         people
0  GOOGLE         27.82       87   845     larry page
1     WMT          4.61      484    65           n.a.
2    MSFT            -1       85    64     bill gates
3     RIL  not avaiable       50  1023  mukesh ambani
4    TATA           5.6       -1  n.a.     ratan tata

In [8]:
#if the header is none
df = pd.read_csv(io.StringIO(uploaded['stock_data.csv'].decode('utf-8')),header=None)
df

            0             1        2      3              4
0  stock data           NaN      NaN    NaN            NaN
1     tickers           eps  revenue  price         people
2      GOOGLE         27.82       87    845     larry page
3         WMT          4.61      484     65           n.a.
4        MSFT            -1       85     64     bill gates
5         RIL  not avaiable       50   1023  mukesh ambani
6        TATA           5.6       -1   n.a.     ratan tata

In [9]:
#we want to put the header name on run time if ur header is missing
df = pd.read_csv(io.StringIO(uploaded['stock_data.csv'].decode('utf-8')),header=None, names=["ticker","eps","revenue","price","people"])
df

       ticker           eps  revenue  price         people
0  stock data           NaN      NaN    NaN            NaN
1     tickers           eps  revenue  price         people
2      GOOGLE         27.82       87    845     larry page
3         WMT          4.61      484     65           n.a.
4        MSFT            -1       85     64     bill gates
5         RIL  not avaiable       50   1023  mukesh ambani
6        TATA           5.6       -1   n.a.     ratan tata

In [10]:
df = pd.read_csv(io.StringIO(uploaded['stock_data.csv'].decode('utf-8')),header=1)
df

  tickers           eps  revenue price         people
0  GOOGLE         27.82       87   845     larry page
1     WMT          4.61      484    65           n.a.
2    MSFT            -1       85    64     bill gates
3     RIL  not avaiable       50  1023  mukesh ambani
4    TATA           5.6       -1  n.a.     ratan tata

In [11]:
#read rows excluding headers
df = pd.read_csv(io.StringIO(uploaded['stock_data.csv'].decode('utf-8')),header=1, nrows=3)
df

  tickers    eps  revenue  price      people
0  GOOGLE  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [12]:
#i want to read NA values
df = pd.read_csv(io.StringIO(uploaded['stock_data.csv'].decode('utf-8')),header=1, na_values=["not avaiable","n.a."])
df

  tickers    eps  revenue   price         people
0  GOOGLE  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3     RIL    NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [14]:
#Sometimes both values are same but we want to change 1 value in 1 place so use dictionary
df = pd.read_csv(io.StringIO(uploaded['stock_data.csv'].decode('utf-8')),header=1, na_values={
    'eps' : ["not avaiable","n.a."],
    'revenue' : ["not avaiable","n.a.",-1],
    'people' : ["not avaiable","n.a."]
})
df

  tickers    eps  revenue price         people
0  GOOGLE  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [15]:
#how to write the csv file
df.to_csv('new.csv')
df

  tickers    eps  revenue price         people
0  GOOGLE  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3     RIL    NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

In [16]:
#but i want to remove the index column
df.to_csv('new.csv', index=False)

In [17]:
#i want to check the columns
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [18]:
#i want to write csv and export only 2 columns
df.to_csv("new.csv",columns=['tickers','eps'])

In [19]:
#sometimes u want to exporting the header
df.to_csv("new.csv", header=False)

In [20]:
#its all about csv file.Now read excel....